# 1. Поработайте с переменными, создайте несколько, выведите на экран, запросите
# у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран..

a = int(input('Введите число А: '))
b = int(input('Введите число B: '))
c = int(input('Введите число C: '))
# d = input('Введите слово 1: ')
# e = input('Введите слово 2: ')
g = a + b + c
x = "Да здравствует"
y = "математика!"

print("Первое число:", a, "Второе число:", b, "Третье число:", c, )
print("...а сумма этих трех чисел равна", g)
print(x, y)
